using System;
using System.Collections.Generic;

namespace курсач
{
    public class WordGenerator : IWordGenerator
    {
        private readonly IList<string> _words ;
        public string GetNewWord()
        {
            var word = _words[new Random().Next(0, _words.Count)];
            return word;
        }

        public WordGenerator()
        {
            _words = new []
            {
                "интуиция", "пользователь", "чиновник", "имущество", "телефон", "марганец", "анархизм",
                "жантильность","багрянец","хитон","эволюционизм","фонотека","палеонтолог","повеса","муштра",
                "гармоника","вольность","апогей","отрок","фонема","затворник","застенок","тонзиллит","курган",
                "бормотун","песчаник","остракизм","инаугурация","виверна","разведенец","геополитика","разо",
                "образина","трирема","корнет","фолиант","барство","нарицание","кашпо","ассимиляция","конгрегация",
                "целесообразность","хронометражист","валторна","трицератопс","гистолог","экзоскелет","преосвященство",
                "антагонист","квантор","фельдфебель","саксаул","электромагнетизм","подхалим","рококо","женоненавистник",
                "бонна","индуктор","натурализм","судосборщик","мадера","дифракция","сателлит","завитушка","хмелевод","ротмистр",
                "геологоразведка","озонатор","макраме","имярек","бутоньерка","номенклатура","парламентарий","коляда",
                "осквернитель","левкой","лицедей","водохлёб","гуманизм","аммоний","пинчер","болтология","антиподера",
                "мимикрия","лейкоз","благородие","камзол","периарий","пустяковина","святотатец","акселерат","мытарь",
                "партитура","хэнё","гиацинт","бактериолог","аккомодация","грузовладелец","мастерок","военачальник",
                "мелюзга","супостат","костоправ","алебастр","восходитель","транквилизатор","аэромеханика","отражатель"
            };
        }
    }
}
